app/views/qualificacoes/_form.html.erb

      <p><%= f.label :cliente_id %><br />
          <%= f.collection_select(:cliente_id, Cliente.order('nome'),
                :id, :nome, {:prompt => true}) %></p>
---
SELECT `clientes`.* FROM `clientes` ORDER BY nome

      <p><%= f.label :restaurante_id %><br />
        <%= f.collection_select(:restaurante_id, Restaurantes.order('nome'),
                      :id, :nome, {:prompt => true}) %></p>
---
SELECT `restaurantes`.* FROM `restaurantes` ORDER BY nome