app/controllers/clientes_controller.rb

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 2 LIMIT 1

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`created_at`, `idade`, `nome`, `updated_at`) VALUES ('2012-12-11 18:20:19', 19, 'Rafael Sodre', '2012-12-11 18:20:19')

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
UPDATE `clientes` SET `idade` = 20, `updated_at` = '2012-12-17 13:00:14' WHERE `clientes`.`id` = 1

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 2 LIMIT 1
DELETE FROM `clientes` WHERE `clientes`.`id` = 2