app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 0 LIMIT 1
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 49 LIMIT 1
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`comentavel_id`, `comentavel_type`, `conteudo`, `created_at`, `updated_at`) VALUES (1, 'restaurante', 'MUITO BOM\r\nGOSTEI\\\r\nLEGALZAO\r\nSHOW', '2012-12-14 19:15:59', '2012-12-14 19:15:59')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
        @comentario.save

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 49 LIMIT 1
UPDATE `comentarios` SET `conteudo` = 'OI,dsç', `updated_at` = '2012-12-17 14:30:46' WHERE `comentarios`.`id` = 49
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 28 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 28
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy