app/controllers/qualificacoes_controller.rb

  def new
    @qualificacao = Qualificacao.new

    if params[:cliente]
     @qualificacao.cliente = Cliente.find(params[:cliente])
    end
    if params[:restaurante]
      @qualificacao.restaurante = Restaurantes.find(params[:Restaurantes])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 2 LIMIT 1