app/controllers/restaurante_controller.rb

   def index
      @restaurantes = Restaurantes.order("nome").page(params['page']).per(2)
---
SELECT COUNT(*) FROM `restaurantes`
SELECT `restaurantes`.* FROM `restaurantes` ORDER BY nome LIMIT 3 OFFSET 0

   def show
      @restaurante = Restaurantes.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1

   def create
      @restaurante = Restaurantes.new(params[:restaurante])
      if @restaurante.save
---
INSERT INTO `restaurantes` (`created_at`, `endereco`, `especialidade`, `foto_content_type`, `foto_file_name`, `foto_file_size`, `foto_updated_at`, `nome`, `updated_at`) VALUES ('2012-12-17 17:33:59', 'Rua do Boi', 'Carnes', NULL, NULL, NULL, NULL, 'Bu', '2012-12-17 17:33:59')

   def edit
      @restaurante = Restaurantes.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1

   def destroy
      @restaurante = Restaurantes.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1